In [1]:
import pandas as pd

In [2]:
df = pd.read_table("http://bit.ly/chiporders")

In [3]:
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [4]:
df1 = pd.read_table("http://bit.ly/movieusers")

In [5]:
df1.head()

   1|24|M|technician|85711
0       2|53|F|other|94043
1      3|23|M|writer|32067
2  4|24|M|technician|43537
3       5|33|F|other|15213
4   6|42|M|executive|98101

### Here | is used as a separater to seperate the rows

In [7]:
df1 = pd.read_table("http://bit.ly/movieusers",sep = '|')

In [8]:
df1.head()

   1  24  M  technician  85711
0  2  53  F       other  94043
1  3  23  M      writer  32067
2  4  24  M  technician  43537
3  5  33  F       other  15213
4  6  42  M   executive  98101

### Here first row is taken from the data

In [9]:
df1 = pd.read_table("http://bit.ly/movieusers",sep = '|',header=None)

In [10]:
df1.head()

   0   1  2           3      4
0  1  24  M  technician  85711
1  2  53  F       other  94043
2  3  23  M      writer  32067
3  4  24  M  technician  43537
4  5  33  F       other  15213

###  We can rename the field names instead of 0,1,2,3

In [11]:
cols = ['id','age','gender','occupation','salary']

df1 = pd.read_table("http://bit.ly/movieusers",sep = '|',header=None,names=cols)

df1.head()

   id  age gender  occupation salary
0   1   24      M  technician  85711
1   2   53      F       other  94043
2   3   23      M      writer  32067
3   4   24      M  technician  43537
4   5   33      F       other  15213

In [12]:
type(df1)

pandas.core.frame.DataFrame

In [13]:
type(df1['age'])

pandas.core.series.Series

In [14]:
type(df1.age)

pandas.core.series.Series

In [15]:
df1.agg

<bound method DataFrame.aggregate of       id  age gender     occupation salary
0      1   24      M     technician  85711
1      2   53      F          other  94043
2      3   23      M         writer  32067
3      4   24      M     technician  43537
4      5   33      F          other  15213
..   ...  ...    ...            ...    ...
938  939   26      F        student  33319
939  940   32      M  administrator  02215
940  941   20      M        student  97229
941  942   48      F      librarian  78209
942  943   22      M        student  77841

[943 rows x 5 columns]>

### Fields with space in it is not supported using the dot (df1.age num) operator. In that case, need to access using the ['age num'] method

In [17]:
'ab'+ 'ab'

'abab'

In [18]:
df1['user_id']= df1['id']+ df1['age']

In [19]:
df1.head()

   id  age gender  occupation salary  user_id
0   1   24      M  technician  85711       25
1   2   53      F       other  94043       55
2   3   23      M      writer  32067       26
3   4   24      M  technician  43537       28
4   5   33      F       other  15213       38

### Have to use ['user id'] while assigning a new field (.) does not work

In [20]:
df1.describe()

               id         age     user_id
count  943.000000  943.000000  943.000000
mean   472.000000   34.051962  506.051962
std    272.364951   12.192740  272.676469
min      1.000000    7.000000   25.000000
25%    236.500000   25.000000  273.500000
50%    472.000000   31.000000  505.000000
75%    707.500000   43.000000  739.500000
max    943.000000   73.000000  995.000000

In [21]:
df1.shape

(943, 6)

In [22]:
df1.dtypes

id             int64
age            int64
gender        object
occupation    object
salary        object
user_id        int64
dtype: object

In [23]:
type(df1)

pandas.core.frame.DataFrame

**The dataframe has methods and attributes. Methods - describe,head. Attribute - dtypes,shape**

Attribute just gives what they are and methods do something in the data frame

In [24]:
df1.axes

[RangeIndex(start=0, stop=943, step=1),
 Index(['id', 'age', 'gender', 'occupation', 'salary', 'user_id'], dtype='object')]

The describe method gives only the int & float fields . To include string or object fields

In [25]:
df1.describe(include=['object'])

       gender occupation salary
count     943        943    943
unique      2         21    795
top         M    student  55414
freq      670        196      9